<?php
// +----------------------------------------------------------------------
// | StartPHP
// +----------------------------------------------------------------------
// | Copyright (c) 20021~2022 Cat Catalpa Vitality All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: company@catcatalpa.com
// +----------------------------------------------------------------------
//系统预置中文语言包

return[
    //系统报错警告语句
    'EC100001'                             =>                              '路由解析错误：无法获取Url信息',
    'EC100002'                             =>                              '自动加载错误：要引入的文件不存在',
    'EC100003'                             =>                              '数据库错误：数据库连接错误',
    'EC100004'                             =>                              '数据库错误：指定的主键字段不存在',
    'EC100005'                             =>                              '数据库错误：指定的数据表不存在',
    'EC100006'                             =>                              '路由解析错误：文件名后缀冗杂',
    'EC100007'                             =>                              '参数错误：提供的参数量过少',
    'EC100008'                             =>                              '视图模板错误：文件内容不允许为空',
    'EC100009'                             =>                              '控制器错误：控制器返回值不能为空',
    'EC100010'                             =>                              '视图模板错误：方法不存在',
    'EC100011'                             =>                              '视图模板错误：视图对象不存在',
    'EC100012'                             =>                              '视图模板错误：视图名不能为空',
    'EC100013'                             =>                              '自动加载错误：未匹配到有效顶级命名空间',
    'EC100014'                             =>                              '自动加载错误：未定义的顶级命名空间',
    
    //开发模式信息提示
    'system_operation'                     =>                              '系统运行情况',
    'system'                               =>                              '系统',
    'running_time'                         =>                              '运行时间',
    'throughput'                           =>                              '吞吐率',
    'require_info'                         =>                              '请求信息',
    'system_version'                       =>                              '系统版本',
    'framework_version'                    =>                              '框架版本',
    'php_version'                          =>                              'PHP版本',
    'zend_version'                         =>                              'Zend版本',
    'interface_type'                       =>                              '接口类型',
    'process_id'                           =>                              '进程ID',
    'index_node'                           =>                              '进程节点',
    'memory'                               =>                              '内存',
    'initial_memory'                       =>                              '内存',
    'current_state'                        =>                              '当前状态',
    'total_consumption'                    =>                              '共计消耗',
    'peak_occupancy'                       =>                              '峰值占用',
    'cpu_state'                            =>                              'CPU状态',
    'has_been_run'                         =>                              '框架运行状态',
    
    //命令行信息提示
    'cache_clear_start'                    =>                              '正在清理框架缓存...',
    'cache_clear_successful'               =>                              '缓存清理成功',
    'has_been_cleared_files_prefix'        =>                              '本次共清理了',
    'has_been_cleared_files_suffix'        =>                              '个文件/文件夹：',
    ];