<?php
// +----------------------------------------------------------------------
// | StartPHP
// +----------------------------------------------------------------------
// | Copyright (c) 20021~2022 Cat Catalpa Vitality All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: company@catcatalpa.com
// +----------------------------------------------------------------------
//生命周期钩子（行为拓展）定义文件
return[
    //应用初始化
    "appInit" => [],
    //自动加载每次被触发前
    "brforeAutoload" => [],
    //自动加载每次被触发后
    "afterAutoload" => [],
    //路由初始化
    "routerInit" => [],
    //模板引擎初始化
    "viewInit" => [],
    //匹配页面内容关键词前
    "brforeParseFile" => [],
    //页面渲染前
    "brforeRender" => [],
    //日志写入前
    "brforeLogWrite" => [],
    //应用销毁前
    "appDestroy" => [],
    ];